-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2
-- 데이터 타입
-- 
-- 문자열   : CHAR VS VARCHAR VS NVARCHAR
-- 숫자     : DECIMAL
-- 날짜     : DATETIME
-- 바이너리 : BLOB
-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2




-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
-- 오브젝트 타입
-- 
-- 테이블   ( TABLE     )
-- 뷰       ( VIEW      )
-- 인덱스   ( INDEX     )
-- 시퀀스   ( SEQUENCE  )
-- 프로시저 ( PROCEDURE )
-- 함수     ( FUNCTION  )
-- 트리거   ( TRIGGER   )
-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@




-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
-- 오브젝트 CUD 조작 : DDL
-- CREATE 
-- ALTER 
-- DROP
-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@




-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2
-- DDL(CREATE/ALTER/DROP) 이란?
--    오브젝트를 조작하기 위한 SQL.
-- 
-- CREATE  TABLE tb_이름 | VIEW vw_이름 | INDEX ix_이름 | PROCEDURE usp_이름 | FUNCTION udf_이름 | SEQUENCE seq_이름  | TRIGGER trg_이름  
-- ALTER   TABLE tb_이름 | VIEW vw_이름 | INDEX ix_이름 | PROCEDURE usp_이름 | FUNCTION udf_이름 | SEQUENCE seq_이름  | TRIGGER trg_이름  
-- DROP    TABLE tb_이름 | VIEW vw_이름 | INDEX ix_이름 | PROCEDURE usp_이름 | FUNCTION udf_이름 | SEQUENCE seq_이름  | TRIGGER trg_이름  
-- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

-- ############
-- 뷰란? 가상 테이블이다. 
--       읽기 전용 select 문이다.
-- 
-- 뷰를 왜 사용하는가?
--     1. 보안
--     2. 간편한 사용
-- ############



-- ############
-- 인덱스는 데이터 검색시 속도 향상을 위해서 사용.
-- 인덱스를 왜 사용하는가?
--   찾는 속도를 빠르게 하기 위해서.
-- 
-- 인덱스 생성 규칙
-- 	where절에서 사용되는 컬럼에는 인덱스 적용을 고려한다..
-- 	where절에서 사용되는 모든 컬럼에 인덱스를 걸라는 말씀은 아닙니다.
--    해당 컬럼 데이터 중복률이 10%이하일 때는 인덱스를 것이 유리하다.
-- 
-- ############


-- ############
-- 시퀀스는 왜 사용하는가?
-- 	자동 증가값 만들 때 사용.
-- 
-- MySQL에서는 시퀀스를 어떻게 만드는가?
--    테이블 생성시 auto_increment를 사용하면 된다.
-- ############



